---
title: 开发者指南
last_updated: 2019-03-20
summary: "为帮助开发者更快地熟悉酷宅开放平台，更迅速地开发应用，酷宅开放平台特编制《开发者指南》"
sidebar: mydoc_sidebar
permalink: developerGuide.html
folder: mydoc
---


## 开发者指南 

- 为帮助开发者更快地熟悉酷宅开放平台，更迅速地开发应用，酷宅开放平台特编制《开发者指南》。
- 《开发者指南》按照应用地开发流程，提供以下帮助文档：

## 准备开发环境

[准备开发环境 点击查看](develop.html)

```
1,首先下载安装易微联测试版APP（已经安装正式版APP，需卸载正式版APP后再安装测试版APP）。
2,使用易微联APP注册测试帐号并登录，登录成功后才能获取权限认证，认证通过才能调用设备相关服务。
3,购买测试设备并用APP添加设备。为后续设备数据服务以及设备控制服务做准备。
4,设备上线后，在APP上控制设备。保证设备控制没问题后，后续通过设备控制服务(websocket)来进行设备控制。
```
	  
## 成为开发者

[成为开发者   点击查看](developer.html)

```
首先需要和销售对接，达成商务合作。平台分配拥有请求云平台服务权限的APPID，同时由销售协调技术支持，通过微信群的方式提供技术支持，缩短开发周期。
```

## 创建第一个应用

[创建第一个应用  点击查看](application.html)

```
介绍如何通过酷宅云平台提供的服务开发自己的应用。从登录到控制设备整个流程通过示范应用更快更容易理解怎么开发自己的应用。
```

## 开发通用说明

[开发通用说明  点击查看](instruction.html)

```
1,HTTP接口必填参数详解。
2,认证的签名规则以及签名算法，指引快速通过安全认证，获取访问接口权限。
3,Access Token以及Refresh Token规则介绍。如何刷新Token。
```

## API中心

[API中心  点击查看](apiOverview.html)

```
提供区域功能，帐号管理功能，设备管理功能，设备控制功能。详细介绍：设备分组，设备设置各类定时器，设备分享等常用功能。
```

## 配对过程

[配对过程  点击查看](pair.html)

```
touch配对和ap配对流程。
```

## SDK 

```
暂无SDK，敬请期待！
```





